# Что такое алгоритмы и структуры данных?

Алгоритм — это рецепт, как заставить компьютер что-то делать. Если вы умеете готовить, вы понимаете алгоритмы!

Тут [рецепт блинчиков](http://allrecipes.com/recipe/21014/good-old-fashioned-pancakes/):

1. В большую миску просеять муку, разрыхлитель, соль и сахар.
2. Влейте молоко, яйцо и растопленное масло.
3. Перемешать до однородности.
4. Разогрейте сковороду на среднем огне.
5. Выложите тесто на сковороду, используя примерно 1/4 стакана на каждый блин.
6. Подрумянить блин с двух сторон.

Рецепт состоит из ряда шагов, которые вы выполняете один за другим. Алгоритм такой же, за исключением того, что он содержит инструкции для компьютера, а не для повара.

Ингредиенты — мука, молоко, яйца, масло — это данные, с которыми работает алгоритм. Данные поступают в алгоритм в одном виде (сырые, отдельные ингредиенты), а выходят в другом (вкусные блинчики!).
